In [1]:
import pandas as pd
from datetime import datetime
import re
import numpy as np

In [2]:
df = pd.read_csv('/Users/jean110284/Desktop/Everything/PythonProgramming/temperature.csv')

In [3]:
df.head(2)

   Region  Country  State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria    NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria    NaN  Algiers      1    2  1995            49.4

In [8]:
# check the name of the columns

print(df.columns.tolist())

['Region', 'Country', 'State', 'City', 'Month', 'Day', 'Year', 'AvgTemperature', 'Date']

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999999 entries, 0 to 999998
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Region          999999 non-null  object
 1   Country         999999 non-null  object
 2   State           0 non-null       float64
 3   City            999999 non-null  object
 4   Month           999999 non-null  int64
 5   Day             999999 non-null  int64
 6   Year            999999 non-null  int64
 7   AvgTemperature  999999 non-null  float64
dtypes: float64(2), int64(3), object(3)
memory usage: 61.0+ MB

In [9]:
# combine year, month, date into one column

df['Date'] = df['Year'].apply(str) + '-' + df['Month'].apply(str) + '-' + df['Day'].apply(str)
df.head(2)

   Region  Country  State     City  Month  Day  Year  AvgTemperature      Date
0  Africa  Algeria    NaN  Algiers      1    1  1995            64.2  1995-1-1
1  Africa  Algeria    NaN  Algiers      1    2  1995            49.4  1995-1-2